for i in range(1, 21):
    print(i)

i = 1
while i <= 20:
    print(i)
    i += 1

#Sequencing  არის კოდის მიმდევრობა ესეიგი როცა კოდს ისე ნაბიჯ-ნაბიჯ მიყვები როგორც იწერება
#Iteration ნიშნავს კოდის ნაწილის მრავალჯერ შესრულებას
#Selection ნიშნავს კოდის მარშრუტის შეცვლას გარკვეული პირობების მიხედვით 

# for ციკლი როდესაც ზუსტად ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.მაგალითად: რიცხვები 1-დან 100-მდე
#while ციკლი როცა ციკლის დასასრულის ზუსტი რაოდენობა წინასწარ არ ვიცით.ვიყენებთ მანამ, სანამ პირობა არ იქნება სიმართლე (True).